Revit 2026 API

# IFCProductWrapperCreate(ExporterIFC, Boolean) Method

---

Establishes a new baseline product manager for elements and objects.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCProductWrapper Create(
	ExporterIFC ExporterIFC,
	bool allowRelateToLevel
)
```
```vb
Public Shared Function Create (
	ExporterIFC As ExporterIFC,
	allowRelateToLevel As Boolean
) As IFCProductWrapper
```
```cpp
public:
static IFCProductWrapper^ Create(
	ExporterIFC^ ExporterIFC,
	bool allowRelateToLevel
)
```
```fsharp
static member Create :
        ExporterIFC : ExporterIFC *
        allowRelateToLevel : bool -> IFCProductWrapper
```

#### Parameters

ExporterIFC ExporterIFC
     The exporter.
allowRelateToLevel Boolean
     True to allow associated elements and objects to relate to a level, false to never allow such a relationship.

#### Return Value

IFCProductWrapper The new baseline product manager.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Elements and objects associated to this product manager will be associated to a top-level IfcProduct based on the world coordinate system of the output file.

#### Reference

IFCProductWrapper Class

Create Overload

Autodesk.Revit.DB.IFC Namespace